---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.Contains(Autodesk.Revit.DB.PanelType)
source: html/f0be757e-325d-cc96-d99f-4729399a111b.htm
---
# Autodesk.Revit.DB.PanelTypeSet.Contains Method

Tests for the existence of a panel type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	PanelType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PanelType`) - The panel type to be searched for.

## Returns
The Contains method returns True if the panel type is within the set, otherwise False.